
# SS-YOLO model configuration (MobileNetv3 backbone + SimAM + D-SimSPPF)
nc: 6
depth_multiple: 1.0
width_multiple: 1.0

# Usually, 3 anchors per scale
anchors:
  - [12,16, 19,36, 40,28]   # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

backbone:
  [[-1, 1, Conv, [16, 3, 2]],          
   [-1, 1, Conv, [16, 3, 1]],          
   [[-2, -1], 1, Shortcut, [0]],       
   [-1, 1, Conv, [64, 1, 1]],          
   [-1, 1, DWConv, [24, 3, 2]],        
   [-1, 1, Conv, [72, 1, 1]],          
   [-1, 1, DWConv, [24, 3, 1]],        
   [[4, -1], 1, Shortcut, [0]],        
   [-1, 1, Conv, [72, 1, 1]],          
   [-1, 1, DWConv, [40, 5, 2]],        
   [-1, 1, Conv, [120, 1, 1]],         
   [-1, 1, DWConv, [40, 5, 1]],        
   [[9, -1], 1, Shortcut, [0]],        
   [-1, 1, Conv, [120, 1, 1]],         
   [-1, 1, DWConv, [40, 5, 1]],        
   [[12, -1], 1, Shortcut, [0]],       
   [-1, 1, Conv, [240, 1, 1]],         
   [-1, 1, DWConv, [80, 3, 2]],        
   [-1, 1, Conv, [200, 1, 1]],         
   [-1, 1, DWConv, [80, 3, 1]],        
   [[17, -1], 1, Shortcut, [0]],       
   [-1, 1, Conv, [184, 1, 1]],         
   [-1, 1, DWConv, [80, 3, 1]],        
   [[20, -1], 1, Shortcut, [0]],       
   [-1, 1, Conv, [184, 1, 1]],         
   [-1, 1, DWConv, [80, 3, 1]],        
   [[23, -1], 1, Shortcut, [0]],       
   [-1, 1, Conv, [480, 1, 1]],         
   [-1, 1, DWConv, [112, 3, 1]],       
   [-1, 1, Conv, [672, 1, 1]],         
   [-1, 1, DWConv, [112, 3, 1]],       
   [[28, -1], 1, Shortcut, [0]],       
   [-1, 1, Conv, [672, 1, 1]],         
   [-1, 1, DWConv, [160, 5, 2]],       
   [-1, 1, Conv, [960, 1, 1]],         
   [-1, 1, DWConv, [160, 5, 1]],       
   [[33, -1], 1, Shortcut, [0]],       
   [-1, 1, Conv, [960, 1, 1]],         
   [-1, 1, DWConv, [160, 5, 1]],       
   [[36, -1], 1, Shortcut, [0]],       
   [-1, 1, Conv, [960, 1, 1]]          
  ]

head:
  [[40, 1, DSimSPPF, [960, 960, 5]],           
   [41, 1, SimAM_Module, [0.1]],       
   [42, 1, Conv, [256, 1, 1]],         
   [43, 1, nn.Upsample, [None, 2, 'nearest']],  
   [26, 1, Conv, [256, 1, 1]],         
   [[45, 44], 1, Concat, [1]],         
   [46, 1, Conv, [256, 1, 1]],         
   [46, 1, Conv, [128, 3, 1]],         
   [48, 1, Conv, [128, 3, 1]],         
   [49, 1, Conv, [128, 1, 1]],         
   [50, 1, nn.Upsample, [None, 2, 'nearest']],  
   [15, 1, Conv, [128, 1, 1]],         
   [[52, 51], 1, Concat, [1]],         
   [53, 1, Conv, [128, 1, 1]],         
   [53, 1, Conv, [64, 3, 1]],          
   [55, 1, Conv, [64, 3, 1]],          
   [56, 1, Conv, [64, 3, 1]],          
   [57, 1, Conv, [64, 3, 1]],          
   [58, 1, Conv, [128, 1, 1]],         
   [59, 1, Conv, [128, 3, 2]],         
   [[60, 50], 1, Concat, [1]],         
   [61, 1, Conv, [256, 1, 1]],         
   [62, 1, Conv, [128, 3, 1]],         
   [63, 1, Conv, [128, 3, 1]],         
   [64, 1, Conv, [256, 3, 2]],         
   [[65, 43], 1, Concat, [1]],         
   [66, 1, Conv, [256, 1, 1]],         
   [67, 1, Conv, [128, 3, 1]],         
   [68, 1, Conv, [128, 3, 1]],         
   [69, 1, SimAM_Module, [0.1]],       
   [[59, 64, 69], 1, IDetect, [nc, anchors]]
  ]
